/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "Status"; /* Display Name */

"mQr54o" = "unbekannt";   /* Value: unknown */
"8K78Gu" = "Unerledigt";      /* Value: open */
"HSjTOt" = "Erledigt"; /* Value: completed */
"1Ncljt" = "Abgebrochen";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Things Aufgabe"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "Titel";     /* Property: title */
"Kw5NWX" = "Liste";      /* Property: list */
"R3fuSz" = "Wann";      /* Property: when */
"8TjwzE" = "Abend";   /* Property: evening */
"gRh7no" = "Nein";        /* Property: evening (false value) */
"WHB5qC" = "Ja";       /* Property: evening (true value) */
"bww4JS" = "Erinnerung";  /* Property: reminder */
"19lPBk" = "Deadline";  /* Property: deadline */
"pp3qBd" = "Notizen";     /* Property: notes */
"UDIc1x" = "Checklist"; /* Property: checklist */
"KQzIKq" = "Tags";      /* Property: tags */

/* TINList */

"x7Empa" = "Things Liste"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "Aufgabe hinzufügen"; /* Title */
"1Xn7Aa" = "Fügt eine neue Aufgabe zu Things hinzu."; /* Description */

"YmSQDf" = "Aufgabe"; /* Parameter: title */
"LHHz9E" = "Was ist der Titel?"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "Liste"; /* Parameter: list */
"X4r1DR" = "Zu welcher Liste möchtest du sie hinzufügen?"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "Wann"; /* Parameter: when */
"VkNe0C" = "Wann möchtest du beginnen?"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "Abend"; /* Parameter: evening */
"b10WOZ" = "Am Abend?"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "Nein"; /* Parameter: evening (false value) */
"KWUIrj" = "Ja"; /* Parameter: evening (true value) */

"AeXgbS" = "Erinnerungs-Uhrzeit"; /* Parameter: reminderTime */
"3Nk1Yl" = "Zu welcher Uhrzeit möchtest du erinnert werden?"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "Deadline"; /* Parameter: deadline */
"xi8sPe" = "Was ist die Deadline?"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "Tags"; /* Parameter: tags */
"l0xizU" = "Welche Tags sollen hinzugefügt werden?"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "Status"; /* Parameter: status */
"sS5Ms4" = "Wie ist der Status?"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "In Things bearbeiten"; /* Parameter: editInThings */
"W5N6Yo" = "Möchtest du Things öffnen, um diese Aufgabe zu bearbeiten?"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "Nein"; /* Parameter: editInThings (false value) */
"ZSGv41" = "Ja"; /* Parameter: editInThings (true value) */

"o8AABR" = "Notizen"; /* Parameter: notes */
"pjyLst" = "Welche Notizen möchtest du hinzufügen?"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "Checklist"; /* Parameter: checklist */
"VIitBC" = "Welche Checklist-Objekte möchtest du hinzufügen?"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "${todoTitle} wurde hinzugefügt."; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "${todoTitle} wurde hinzugefügt."; /* Response Code: success (printed dialog) */
"sr1IRz" = "Beim Hinzufügen der Aufgabe ist ein Fehler aufgetreten."; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "Beim Hinzufügen der Aufgabe ist ein Fehler aufgetreten."; /* Response Code: failure (printed dialog) */
"j6LE7B" = "Die Aufgabe wurde hinzugefügt."; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "Die Aufgabe wurde hinzugefügt."; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "Aufgabentitel"; /* Response Parameter: todoTitle */
"Br1Zm3" = "Aufgabe"; /* Response Parameter: todo */

"9LylOv" = "${title} hinzufügen"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "${title} hinzufügen"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "Aufgabe anzeigen"; /* Title */
"JdIZ8x" = "Zeigt die angegebene Aufgabe in Things an."; /* Description */

"WAIq5F" = "Aufgabe"; /* Parameter: todo */

"YIbDyi" = "${todo} anzeigen"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "Liste anzeigen"; /* Title */
"xo5PDm" = "Zeigt die angegebene Liste in Things an."; /* Description */

"RW2Nyz" = "Liste"; /* Parameter: list */
"V1nlDA" = "Welche Liste?"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "Nach Tags filtern"; /* Parameter: filterByTags */
"HQ0TAS" = "Welche Tags?"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "${list} anzeigen"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "${list} anzeigen"; /* Shortcuts App: list (title) */

"mlANgr" = "${list} anzeigen"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "Things-URL ausführen"; /*  Title */
"keYeZ9" = "Führt eine Things-URL im Hintergrund aus."; /*  Description */

"uPeA3l" = "Things URL"; /*  Parameter: url */
"oTrE0f" = "Wie ist die URL?"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "Die URL wurde erfolgreich ausgeführt."; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "Die URL wurde erfolgreich ausgeführt."; /*  Response Code: success (printed dialog) */
"a4aEdR" = "Die URL konnte nicht ausgeführt werden."; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "Die URL konnte nicht ausgeführt werden."; /*  Response Code: failure (printed dialog) */

"uth0Px" = "Things-URL ausführen ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "Aufgaben hinzufügen"; /* Title */
"J4CdGj" = "Verwendet die integrierte Funktionalität zum Hinzufügen von Aufgaben zu Things. Unterstützt nur eine begrenzte Auswahl von Parametern."; /* Intent AddTasks -> Description */

"IF3OZi" = "Aufgabenliste"; /* Parameter: targetTaskList */
"uNB8yE" = "Titel"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "Things öffnen"; /* Suggestions:  (title) */
